<h1><center> Data Analysis: Introduction to Pandas </center></h1>

<h2> Part II. Filtering and Sorting Data </h2>

<i>Example 1. Import the necessary libraries</i>

In [206]:
import pandas as pd

<i>Example 2. Import the dataset from the local file </i>

In [207]:
order_list = pd.read_csv('./order_list.csv', sep = '\t')
order_list.head()

,id,quantity,food,description,unit_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

<i>Example 3. Convert the <i>"unit_price"</i> column to float type</i>

In [208]:
#Convert unit price to float (No $)
prices = []
for value in order_list.unit_price:
    value_f = float(value[1: -1])
    prices.append(value_f)
order_list.unit_price = prices
order_list.head()

,id,quantity,food,description,unit_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

<b>Exercise 1. Eliminate the rows with duplicate value in the dataset</b>

In [209]:
order_list_2 = order_list.drop_duplicates()
order_list_2.shape
order_list_2.head()

,id,quantity,food,description,unit_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

<b>Exercise 2. Display the orders which costs more than $20?</b>

In [210]:
order_list_2['total_price'] = order_list_2['quantity'] * order_list_2['unit_price']
order_list_2.head()

/var/folders/bh/3yn_1rsd3fn2j2cnydsmxnz40000gn/T/ipykernel_7827/3258214599.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  order_list_2['total_price'] = order_list_2['quantity'] * order_list_2['unit_price']

,id,quantity,food,description,unit_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [221]:
order_price = (order_list_2[['id', 'total_price']].groupby('id', as_index=False).aggregate(order_price = ('total_price', 'sum')))
more_than_20 = order_price[order_price['order_price']>20]

<b>Exercise 3. How many orders that costs more than $20?</b>

In [223]:
more_than_20 ['id'].nunique()

616

<b>Exercise 4. Sort the list by the name of the food in alphabetical order.</b>

In [224]:
order_list_2.sort_values('food', ascending=True)

,id,quantity,food,description,unit_price,total_price
4527,1800,1,6 Pack Soft Drink,[Diet Coke],6.49,6.49
2374,945,1,6 Pack Soft Drink,[Sprite],6.49,6.49
2860,1136,1,6 Pack Soft Drink,[Diet Coke],6.49,6.49
1755,708,1,6 Pack Soft Drink,[Coke],6.49,6.49
1279,520,1,6 Pack Soft Drink,[Sprite],6.49,6.49
...,...,...,...,...,...,...
738,304,1,Veggie Soft Tacos,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.25,11.25
1395,567,1,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",8.49,8.49
1699,688,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
2851,1132,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",8.49,8.49
3889,1559,2,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Black Beans, Rice...",16.98,33.96

<b>Exercise 5a. Display the list by the total quantity of each order sorted in descending order.

In [231]:
total_quantity = order_list_2[['id', 'quantity']].groupby('id', as_index=False
                ).agg(total_quantity=('quantity', 'sum')).sort_values('total_quantity', ascending=False)

total_quantity

        id  total_quantity
1442  1443              35
925    926              21
1785  1786              20
758    759              18
1659  1660              18
...    ...             ...
511    512               1
1384  1385               1
1077  1078               1
779    780               1
916    917               1

[1834 rows x 2 columns]

<b>Exercise 5b. Which order has the highest price?

In [232]:
highest_price = (order_list_2[['id', 'total_price']].groupby('id', as_index=False)
                 .agg(order_price =  ('total_price', 'sum'))
                 .sort_values('order_price', ascending=False))


highest_price.head()

        id  order_price
1442  1443      1074.24
510    511       315.29
1558  1559       246.00
1659  1660       218.30
1785  1786       197.70

<b>Exercise 6. Display the list of the orders of "Tacos" (All types of Tacos) and sort by the price in ascending order.</b>

In [ ]:
tacos = order_list_2[order_list_2['food'].str.contains('Tacos')]
order_price_tacos = ( tacos[['id', 'total_price']].groupby('id', as_index=False)
                     .agg(order_price = ('total_price', 'sum'))
                     .sort_values('order_price', ascending=True))

order_price_tacos.head()

       id  order_price
153   867         8.49
210  1211         8.49
209  1210         8.49
204  1156         8.49
198  1132         8.49

<b>Exercise 7. How many orders was made for "Salad"?</b>

In [244]:
salad = order_list_2[order_list_2['food'].str.contains('Salad')]
salad['id'].unique().shape[0]

171

<b>Exercise 8. How many "Salad" were sold?</b>

In [248]:
quantity_salad = salad[['quantity']].sum()

quantity_salad

quantity    209
dtype: int64

<b>Exercise 9. Display the list of orders of "Soft Tacos" with the minimum of 2 Soft Tacos?</b>

In [260]:
soft_tacos = order_list_2[order_list_2['food'].str.contains('Soft Tacos')]

quantity_soft_tacos = (soft_tacos[['id', 'quantity']].groupby('id', as_index=False
                ).agg(total_quantity =('quantity', 'sum'))

)

quantity_soft_tacos[quantity_soft_tacos['total_quantity'] >= 2]#['id'].nunique()

       id  total_quantity
2      18               2
21    145               2
22    149               2
23    153               2
27    185               2
36    237               2
72    565               2
75    583               2
87    675               2
113   839               2
122   906               2
123   907               2
125   916               2
127   923               2
133   996               2
166  1340               2
176  1449               2
179  1462               2
182  1483               2
188  1559               4
203  1670               2
212  1738               2

<b>Exercise 10. How many orders of more than two Steak Burrito?</b>

In [298]:
steak_burrito = order_list_2[order_list_2['food'].str.contains('Steak Burrito')]

quantity_steak_burrito = (steak_burrito[['id', 'quantity']].groupby('id', as_index=False
                ).agg(total_quantity =('quantity', 'sum'))
)
more_than_2 = quantity_steak_burrito[quantity_steak_burrito['total_quantity'] > 2]
print(more_than_2['id'].unique())

[ 511  691 1431 1443]

>Exercise 11. Find the mean of the number of Water ordered each time?</b>

In [306]:
# Filter orders for 'Bottled Water'
water_orders = order_list_2[order_list_2['food'].str.contains('Bottled Water')]

quantity_water = water_orders[['id', 'quantity']].groupby('id', as_index=False).agg(total_quantity=('quantity', 'sum'))

# Calculate the mean number of water ordered each time
mean_water_ordered = quantity_water.mean()
float(mean_water_ordered['total_quantity'])

1.3246753246753247